1. How do you get list of all the key in dictionary

In [ ]:
dic = {"India":"New Delhi", "USA":"Washington DC","France":"Paris","Spain":"Madrid"}
dic.keys()

dict_keys(['India', 'USA', 'France', 'Spain'])

2. 1. How do you get list of all the value in dictionary

In [8]:
dic = {"India":"New Delhi", "USA":"Washington DC","France":"Paris","Spain":"Madrid"}
dic.values()

dict_values(['New Delhi', 'Washington DC', 'Paris', 'Madrid'])

3. What do you mean by list comprehension in python.

List comprehension are sort and elegent way to define and create a new list based on existing list.

In [ ]:
### Without list comprehension
l = [5, 12 , 14, 10, 43, 11, 7, 9, 6]

list1 = []

for item in l:
    if item%2 == 0:
        list1.append(item)
print("Result list using for loop : ", list1)

Result list using for loop :  [12, 14, 10, 6]

In [10]:
### List comprehension

l = [5, 12 , 14, 10, 43, 11, 7, 9, 6]

list1 = [item for item in l if item % 2 == 0]
print("Result using list comprehension : ",list1)

Result using list comprehension :  [12, 14, 10, 6]

4. Given a list of number find the square of number using the map function in python.

In [13]:
def square(x):
    return x*x
square(10)

100

In [15]:
def square(x):
    return x*x
num = [1,2,3,4,5,6,7]
list(map(square, num))

[1, 4, 9, 16, 25, 36, 49]

5. Write a program to filter out the number divisible by 3 from a tuple using lambda function.

Lambda function are anonynous funtion that are not defined by def keyword in Python

In [18]:
tup = (5,12,10,18,43,9,7,11,6)

new_tup = tuple(filter(lambda x:(x % 3==0), tup))
print(new_tup)

(12, 18, 9, 6)

6. How to creare a dataframe from a dictionary.

To create a dataframe from dictionary use the pandas library and .dataframe function

In [24]:
import pandas as pd
emp = {
    "Name" : ["John","Angela","Sameul","Ammy"],
    "age" : [45, 23, 27, 32],
    "City" : ["New York", "Chicago", "Seattle", "California"]
}

df = pd.DataFrame(emp)
print(df)

     Name  age        City
0    John   45    New York
1  Angela   23     Chicago
2  Sameul   27     Seattle
3    Ammy   32  California

7. What is the differance between loc() and iloc() in python.

- loc() used for row and column labels to select and slice data from a dataframe.
- iloc() uses integer index to select specific rows and column.

In [27]:
car = pd.DataFrame({
    'Brand': ['Ford', 'Hyundai', 'Tata',
              'Mahindra', 'Maruti', 'Hyundai',
              'Renault', 'Tata', 'Kia'],
    
    'Year': [2016, 2012, 2011, 2010, 2009,
             2010, 2012, 2017, 2019],
    
    'Kms': [23000, 40000, 38000,
            45000, 50000, 46000,
            18000, 9000, 5000],
    
    'City': ['Kolkata', 'Mumbai', 'Delhi',
             'Bangalore', 'Mumbai', 'Bangalore',
             'Chennai', 'Bangalore', 'Chennai'],
    
    'Mileage': [25, 27, 25, 26, 28,
                29, 24, 21, 19]
})

In [28]:
print(car)

      Brand  Year    Kms       City  Mileage
0      Ford  2016  23000    Kolkata       25
1   Hyundai  2012  40000     Mumbai       27
2      Tata  2011  38000      Delhi       25
3  Mahindra  2010  45000  Bangalore       26
4    Maruti  2009  50000     Mumbai       28
5   Hyundai  2010  46000  Bangalore       29
6   Renault  2012  18000    Chennai       24
7      Tata  2017   9000  Bangalore       21
8       Kia  2019   5000    Chennai       19

In [ ]:
## loc()
car.loc[2:5, ["Brand", "City"]]

      Brand       City
2      Tata      Delhi
3  Mahindra  Bangalore
4    Maruti     Mumbai
5   Hyundai  Bangalore

In [33]:
## iloc()
car.iloc[2:5,1:4]

   Year    Kms       City
2  2011  38000      Delhi
3  2010  45000  Bangalore
4  2009  50000     Mumbai

In [36]:
## iloc()
car.iloc[2:5,[1,4,3]]

   Year  Mileage       City
2  2011       25      Delhi
3  2010       26  Bangalore
4  2009       28     Mumbai

In [38]:
print(car.loc[car["Mileage"]<25,["Brand", "City"]])

     Brand       City
6  Renault    Chennai
7     Tata  Bangalore
8      Kia    Chennai

In [42]:
print(car.iloc[(car["Mileage"]<25).values,[0,2]])

     Brand    Kms
6  Renault  18000
7     Tata   9000
8      Kia   5000

8. How is list.append() method is different from list.extend().

list.append() :- adds its argument as a single element to the end of a list.

The length of the list increases by one.

In [43]:
list1 = ['India', 'USA', 'Canada']
list1.append(['France', 'Spain'])
print(list1)

['India', 'USA', 'Canada', ['France', 'Spain']]

list.extend() :- iterates over its argument and adds each element to the list.

The length of the list increases by the number of elements in its argument.

In [44]:
list1 = ['India', 'USA', 'Canada']
list1.extend(['France', 'Spain'])
print(list1)

['India', 'USA', 'Canada', 'France', 'Spain']

9. Suppose you havae car dataset which has a Mileage column create a new field call mlg that will accept two value - if mileage < 25 then "low mileage", if mileage > 25 "high mileage".

In [45]:
f = lambda x: "low mlg" if x < 25 else "high mlg"
car['mlg'] = car.Mileage.apply(f)
print(car)

      Brand  Year    Kms       City  Mileage       mlg
0      Ford  2016  23000    Kolkata       25  high mlg
1   Hyundai  2012  40000     Mumbai       27  high mlg
2      Tata  2011  38000      Delhi       25  high mlg
3  Mahindra  2010  45000  Bangalore       26  high mlg
4    Maruti  2009  50000     Mumbai       28  high mlg
5   Hyundai  2010  46000  Bangalore       29  high mlg
6   Renault  2012  18000    Chennai       24   low mlg
7      Tata  2017   9000  Bangalore       21   low mlg
8       Kia  2019   5000    Chennai       19   low mlg

10. Create 4X4 matrix and find the sum of all the diagonal elements in the matrix.

In [48]:
import numpy as np

num = np.array([[1,1,2,3],
                [5,6,7,8],
                [9,10,11,12],
                [13,14,15,16]])

print(num.diagonal())
print("\n")
print(num.diagonal().sum())

[ 1  6 11 16]


34

In [57]:
nums = np.arange(1,17).reshape(4,4)
print(nums.diagonal().sum())

34

11. Given a vehicle dataframe, find the average and maximum mileage of the vehicle using pandas.

In [60]:
Vehicle = pd.DataFrame({
    'Brand': ['Ford', 'Hyundai', 'Tata',
              'Mahindra', 'Maruti', 'Hyundai',
              'Renault', 'Tata', 'Kia'],
    
    'Year': [2016, 2012, 2011, 2010, 2009,
             2010, 2012, 2017, 2019],
    
    'Kms': [23000, 40000, 38000,
            45000, 50000, 46000,
            18000, 9000, 5000],
    
    'City': ['Kolkata', 'Mumbai', 'Delhi',
             'Bangalore', 'Mumbai', 'Bangalore',
             'Chennai', 'Bangalore', 'Chennai'],
    
    'Mileage': [25, 27, 25, 26, 28,
                29, 24, 21, 19]
})

In [61]:
print(Vehicle)

      Brand  Year    Kms       City  Mileage
0      Ford  2016  23000    Kolkata       25
1   Hyundai  2012  40000     Mumbai       27
2      Tata  2011  38000      Delhi       25
3  Mahindra  2010  45000  Bangalore       26
4    Maruti  2009  50000     Mumbai       28
5   Hyundai  2010  46000  Bangalore       29
6   Renault  2012  18000    Chennai       24
7      Tata  2017   9000  Bangalore       21
8       Kia  2019   5000    Chennai       19

In [63]:
result = Vehicle.groupby('Brand').agg({"Mileage":["mean", "max"]})
print(result)

         Mileage
            mean max
Brand
Ford        25.0  25
Hyundai     28.0  29
Kia         19.0  19
Mahindra    26.0  26
Maruti      28.0  28
Renault     24.0  24
Tata        23.0  25